In [94]:
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
sns.set()

# Read data

In [95]:
train = pd.read_csv('input/train.csv', index_col='PassengerId')
train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [96]:
test = pd.read_csv('input/test.csv', index_col='PassengerId')
test.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [97]:
test.tail()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [98]:
both = pd.concat([train.drop('Survived', axis=1), test])
both.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [99]:
both.tail()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

# Adding 'Title' category

In [100]:
def get_title(full_name):
    return full_name.split(',')[1].split('.')[0].strip()

In [101]:
train['Title'] = train['Name'].apply(get_title)
test['Title'] = test['Name'].apply(get_title)
both['Title'] = both['Name'].apply(get_title)

In [102]:
print('Training title info:')
pd.DataFrame({'Title Instances' :train['Title'].value_counts(), 
              '% survived': round(train.groupby(by='Title')['Survived'].mean()*100)}).sort_values(by='Title Instances', ascending=False)

Training title info:

              Title Instances  % survived
Mr                        517        16.0
Miss                      182        70.0
Mrs                       125        79.0
Master                     40        57.0
Dr                          7        43.0
Rev                         6         0.0
Major                       2        50.0
Col                         2        50.0
Mlle                        2       100.0
Sir                         1       100.0
Ms                          1       100.0
Capt                        1         0.0
Mme                         1       100.0
Lady                        1       100.0
Jonkheer                    1         0.0
Don                         1         0.0
the Countess                1       100.0

In [103]:
print(f"Test Title info:\n {test['Title'].value_counts()}")

Test Title info:
 Mr        240
Miss       78
Mrs        72
Master     21
Rev         2
Col         2
Dona        1
Dr          1
Ms          1
Name: Title, dtype: int64

In [104]:
pd.DataFrame({'Title Instances' :both['Title'].value_counts(), 
              'Medium age': both.groupby('Title')['Age'].median()}).sort_values(by='Title Instances', ascending=False)

              Title Instances  Medium age
Mr                        757        29.0
Miss                      260        22.0
Mrs                       197        35.5
Master                     61         4.0
Rev                         8        41.5
Dr                          8        49.0
Col                         4        54.5
Ms                          2        28.0
Major                       2        48.5
Mlle                        2        24.0
Sir                         1        49.0
Capt                        1        70.0
Mme                         1        24.0
Lady                        1        48.0
Jonkheer                    1        38.0
Dona                        1        39.0
Don                         1        40.0
the Countess                1        33.0

#### Titles conclusions:
- Main categories: Mr, Miss, Mrs, Master
- Might be able to consider as a category: Rev, Dr (each appearing 6-7 times in the training sample).  Rev - all not survived, Dr - 50% survived, above average Mr.  Although they don't behave so much like a Mr. - still think we can't learn too much from such small numbers, putting together with Mr.
- The rest appear so rarely, doesn't make sense to make conclusions based on their survival rate inside the title.  Doesn't make sense to leave as a separate category, since don't have much in common.  Splitting into categories based on gender, age and marital status.

In [106]:
both['Mapped Title'] = both['Title'].replace({'Lady': 'Mrs', 
                                              'Mme': 'Mrs',
                                              'Dona': 'Mrs',
                                              'the Countess': 'Mrs',
                                              'Ms': 'Miss', 
                                              'Mlle': 'Miss',
                                              'Sir': 'Mr',
                                              'Major': 'Mr',
                                              'Capt': 'Mr',
                                              'Jonkheer': 'Mr',
                                              'Don': 'Mr',
                                              'Col': 'Mr',
                                              'Rev': 'Mr',
                                              'Dr': 'Mr'})
both['Mapped Title'].value_counts()

Mr        783
Miss      264
Mrs       201
Master     61
Name: Mapped Title, dtype: int64